<?php
/**
 * Author: 沧澜
 * Date: 2019-12-30
 */

use VladimirYuldashev\LaravelQueueRabbitMQ\Constants\RabbitMQEvent;

return [
    
    /*
    |--------------------------------------------------------------------------
    | Rabbit MQ 事件监听配置
    |--------------------------------------------------------------------------
    |
    */
    'event_disable' => false,
    'event' => RabbitMQEvent::JOB_NONE,
    
    /*
    |--------------------------------------------------------------------------
    | 生产者job映射集合
    |--------------------------------------------------------------------------
    | '$queueName' => [
    |     key => xxxJob::class
    | ]
    |
    */
    'map' => [
    
    ],
    
];
